org/getting-started-with-org-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-09-28 Fri 19:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Getting Started with Org-Mode</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Getting Started with Org-Mode</h1>
<div id="outline-container-org025e0ee" class="outline-2">
<h2 id="org025e0ee"><span class="section-number-2">1</span> Tutorial</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Sub heading (M-&lt;enter&gt;) to create more items of the same type</li>
<li>Test USD export</li>
</ul>
</div>
</div>

<div id="outline-container-orga1b7dcc" class="outline-2">
<h2 id="orga1b7dcc"><span class="section-number-2">2</span> <a href="https://orgmode.org/org.html#Markup">Markdown similarities</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Bold</b> <i>italic</i> <code>verbatim</code> <del>strikethrough</del>
</p>

<ul class="org-ul">
<li>bulleted</li>
<li>list</li>
<li>items</li>
</ul>
</div>
</div>

<div id="outline-container-org66de10d" class="outline-2">
<h2 id="org66de10d"><span class="section-number-2">3</span> <a href="https://orgmode.org/org.html#toc-Hyperlinks-1">Hyperlinks</a></h2>
<div class="outline-text-2" id="text-3">
<p>
(C-c C-l) to insert a link
</p>

<ul class="org-ul">
<li>internal link</li>
</ul>

<p>
<a href="#org1c7a523">Tables</a>
</p>

<p>
(C-c l) to store a link to the current location
</p>

<p>
<a href="#org737260a">Export</a>
</p>

<p>
(C-c C-l) to insert link and (&lt;up&gt;) to select stored link from the key ring
</p>

<ul class="org-ul">
<li>external link</li>
</ul>

<p>
<a href="http://orgmode.org">orgmode website</a>
</p>
</div>

<div id="outline-container-orgeccbcc4" class="outline-3">
<h3 id="orgeccbcc4"><span class="section-number-3">3.1</span> <span class="done DONE">DONE</span> : Link to files emails or todo items</h3>
<div class="outline-text-3" id="text-3-1">
</div>
</div>
</div>

<div id="outline-container-org1c7a523" class="outline-2">
<h2 id="org1c7a523"><span class="section-number-2">4</span> <a href="https://orgmode.org/org.html#Tables">Tables</a></h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
(M-&lt;up&gt;) (M-&lt;down&gt;) (M-&lt;left&gt;) (M-&lt;right&gt;) manipulate rows and cols                           
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Some</th>
<th scope="col" class="org-left">Data</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">12</td>
<td class="org-left">buckle my shoe</td>
</tr>

<tr>
<td class="org-right">34</td>
<td class="org-left">shut the door</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7707a09" class="outline-2">
<h2 id="org7707a09"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> More on how tables are actually spreadsheets</h2>
</div>

<div id="outline-container-org737260a" class="outline-2">
<h2 id="org737260a"><span class="section-number-2">6</span> Export</h2>
<div class="outline-text-2" id="text-6">
<p>
output html
</p>

<p>
(C-c C-e)(h-o)
</p>
</div>

<div id="outline-container-org04f741c" class="outline-3">
<h3 id="org04f741c"><span class="section-number-3">6.1</span> <a href="https://orgmode.org/org.html#Property-syntax">Properties</a></h3>
<div class="outline-text-3" id="text-6-1">
</div>
</div>
</div>

<div id="outline-container-org0755717" class="outline-2">
<h2 id="org0755717"><span class="section-number-2">7</span> Source Code</h2>
<div class="outline-text-2" id="text-7">
<p>
(&lt;-s-&lt;tab&gt;) shortcut to create BEGIN/END tag
(C-') edit the source code (C-') again to commit
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">import</span> time
<span style="color: #20b2aa; font-weight: bold;">return</span> (<span style="color: #ffa07a;">"Hello, today's date is %s"</span> % time.ctime())
</pre>
</div>
</div>
</div>

<div id="outline-container-org4fec910" class="outline-2">
<h2 id="org4fec910"><span class="section-number-2">8</span> <span class="done DONE">DONE</span> Setup babel execution for python</h2>
<div class="outline-text-2" id="text-8">
</div>
</div>

<div id="outline-container-org1254ba5" class="outline-2">
<h2 id="org1254ba5"><span class="section-number-2">9</span> <span class="done DONE">DONE</span> Package "minted" for syntax highlighted export</h2>
<div class="outline-text-2" id="text-9">
</div>
</div>

<div id="outline-container-org02e145d" class="outline-2">
<h2 id="org02e145d"><span class="section-number-2">10</span> LaTeX integration</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>Characters: &alpha; &rarr;</li>
<li>\(O(n \logn)\)</li>
</ul>

\begin{align*}
  3 * 2 + &= 6 + 1 \\
          &= 7
\end{align*}

\begin{minted}[mathescape,
               linenos,
               numbersep=5pt,
               gobble=2,
               frame=lines,
               framesep=2mm]{csharp}
string title = "This is a Unicode p in the sky"
/*
Defined as \(\pi=\lim_{n\to\infty}\frac{P_n}{d}\) where \(P\) is the perimeter
of an $n$-sided regular polygon circumscribing a
circle of diameter \(d\).
*/
const double pi = 3.1415926535
\end{minted}
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-09-28 Fri 19:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
